package 结构型模式.No10组合模式;

import 结构型模式.No10组合模式.叶子节点.MenuItem;
import 结构型模式.No10组合模式.抽象根节点.MenuComponent;
import 结构型模式.No10组合模式.树枝节点.Menu;

/**
 * 定义：
 *   又名部分整体模式，是用于把一组相似的对象当作一个单一的对象。
 *   组合模式依据树形结构来组合对象，用来表示部分以及整体层次。这种类型的设计模式属于结构型模式，它创建了对象组的树形结构。
 *
 * 组合模式主要包含三种角色：
 *   抽象根节点（Component）：定义系统各层次对象的共有方法和属性，可以预先定义一些默认行为和属性。
 *   树枝节点（Composite）：定义树枝节点的行为，存储子节点，组合树枝节点和叶子节点形成一个树形结构。
 *   叶子节点（Leaf）：叶子节点对象，其下再无分支，是系统层次遍历的最小单位。
 *
 * 在使用组合模式时，根据抽象构件类的定义形式，我们可将组合模式分为透明组合模式和安全组合模式两种形式。
 *   透明组合模式：
 *     透明组合模式中，抽象根节点角色中声明了所有用于管理成员对象的方法，比如在示例中 `MenuComponent` 声明了 `add`、`remove`方法，这样做的好处是确保所有的构件类都有相同的接口。透明组合模式也是组合模式的标准形式。
 *     透明组合模式的缺点是不够安全，因为叶子对象和容器对象在本质上是有区别的，叶子对象不可能有下一个层次的对象，即不可能包含成员对象，因此为其提供 add()、remove() 等方法是没有意义的，这在编译阶段不会出错，但在运行阶段如果调用这些方法可能会出错（如果没有提供相应的错误处理代码）
 *   安全组合模式
 *     在安全组合模式中，在抽象构件角色中没有声明任何用于管理成员对象的方法，而是在树枝节点 `Menu` 类中声明并实现这些方法。安全组合模式的缺点是不够透明，因为叶子构件和容器构件具有不同的方法，且容器构件中那些用于管理成员对象的方法没有在抽象构件类中定义，因此客户端不能完全针对抽象编程，必须有区别地对待叶子构件和容器构件。
 */

/**
 * 示例：软件菜单
 * 一个菜单可以包含菜单项（菜单项是指不再包含其他内容的菜单条目），也可以包含带有其他菜单项的菜单
 * 因此使用组合模式描述菜单就很恰当，我们的需求是针对一个菜单，可以直接打印出其包含的所有菜单以及菜单项的名称，而不需要手动使用递归等方式。
 */

public class Client {
    public static void main(String[] args) {
        MenuComponent menu1 = new Menu("二级菜单——1", 2);
        menu1.add(new MenuItem("三级菜单项——1",3));
        menu1.add(new MenuItem("三级菜单项——2",3));
        menu1.add(new MenuItem("三级菜单项——3",3));

        MenuComponent menu2 = new Menu("二级菜单——2", 2);
        menu2.add(new MenuItem("三级菜单项——4",3));
        menu2.add(new MenuItem("三级菜单项——5",3));

        MenuComponent menu3 = new Menu("二级菜单——3", 2);
        menu3.add(new MenuItem("三级菜单项——6",3));
        menu3.add(new MenuItem("三级菜单项——7",3));
        menu3.add(new MenuItem("三级菜单项——8",3));
        menu3.add(new MenuItem("三级菜单项——9",3));

        MenuComponent menu = new Menu("一级总菜单", 1);
        menu.add(menu1);
        menu.add(menu2);
        menu.add(menu3);
        menu.print();
    }
}
